app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT `accounts`.* FROM `accounts`

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO `accounts` (`city`, `state`, `idiom`, `created_at`, `updated_at`) VALUES ('Campina Grande', 'Paraíba', 'Chinês', '2015-05-22 14:14:09', '2015-05-22 14:14:09')

    def set_account
      @account = Account.find(params[:id])
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1